import React from "react";

const Sex = () => {
  return (
    <div className="">
      <div class="overflow-x-auto">
  <table class="table w-full">
    <thead>
      <tr>
        <th></th>
        <th>เพศ</th>
        <th>ลักษณะนิสัย</th>
      </tr>
    </thead>
    <tbody>
      <tr class="hover">
        <th>1</th>
        <td>ชาย</td>
        <td>คนที่มีอวัยวะเพศชาย ชอบแต่งตัวในแบบผู้ชาย มีจิตใจเป็นเพศชาย และรักใคร่ผู้หญิง</td>
      </tr>
      <tr class="hover">
        <th>2</th>
        <td>หญิง</td>
        <td>คนที่มีอวัยวะเพศหญิง ชอบแต่งตัวในแบบผู้หญิง  มีจิตใจเป็นเพศหญิง  และรักใคร่ผู้ชาย</td>
      </tr>
      <tr class="hover">
        <th>3</th>
        <td>ทอม</td>
        <td>คนที่มีอวัยวะเพศหญิง ชอบแต่งตัวในแบบผู้ชาย มีจิตใจเป็นเพศชาย และรักใคร่ผู้หญิงและดี้</td>
      </tr>
      <tr class="hover">
        <th>4</th>
        <td>ดี้</td>
        <td>คนที่มีอวัยวะเพศหญิง ทำตัวเป็นผู้หญิง แต่รักใคร่ทอม</td>
      </tr>
      <tr class="hover">
        <th>5</th>
        <td>ทอมเกย์</td>
        <td>คนที่มีอวัยวะเพศหญิง ชอบแต่งตัวเป็นผู้ชาย แต่รักใคร่ได้ทั้งผู้หญิง ทอม และดี้</td>
      </tr>
      <tr class="hover">
        <th>6</th>
        <td>ทอมเกย์คิง</td>
        <td>คนที่มีอวัยวะเพศหญิง ชอบแต่งตัวเป็นผู้ชาย แต่รักใคร่เฉพาะทอม โดยชอบเป็นฝ่ายรุก</td>
      </tr>
      <tr class="hover">
        <th>7</th>
        <td>ทอมเกย์ควีน</td>
        <td>คนที่มีอวัยวะเพศหญิง ชอบแต่งตัวเป็นผู้ชาย แต่รักใคร่เฉพาะทอม โดยชอบเป็นฝ่ายรับ</td>
      </tr>
      <tr class="hover">
        <th>8</th>
        <td>ทอมเกย์ทูเวย์</td>
        <td>คนที่มีอวัยวะเพศหญิง ชอบแต่งตัวเป็นผู้ชาย แต่รักใคร่เฉพาะทอม โดยชอบเป็นทั้งฝ่ายรุกและรับ</td>
      </tr>
      <tr class="hover">
        <th>9</th>
        <td>เกย์คิง</td>
        <td>คนที่มีอวัยวะเพศชาย ทำตัวเป็นผู้ชาย แต่รักใคร่ผู้ชาย และชอบเป็นฝ่ายรุก</td>
      </tr>
      <tr class="hover">
        <th>10</th>
        <td>เกย์ควีน</td>
        <td>คนที่มีอวัยวะเพศชาย ทำตัวเป็นผู้ชาย อาจมีจริตของผู้หญิง แต่รักใคร่ผู้ชาย และชอบเป็นฝ่ายรับ</td>
      </tr>
      <tr class="hover">
        <th>11</th>
        <td>โบ๊ท</td>
        <td>คนที่มีอวัยวะเพศชาย ทำตัวเป็นผู้ชาย รักใคร่ได้ทั้งผู้หญิง เกย์คิง และเกย์ควีน ยกเว้นกะเทย และเป็นได้ทั้งฝ่ายรุกและรับ</td>
      </tr>
      <tr class="hover">
        <th>12</th>
        <td>ไบท์</td>
        <td>คนที่มีอวัยวะเพศหญิง ทำตัวเป็นผู้หญิง แต่รักใคร่ทั้งทอม เลสเบี้ยน และผู้ชาย</td>
      </tr>
      <tr class="hover">
        <th>13</th>
        <td>เลสเบี้ยน</td>
        <td>คนที่มีอวัยวะเพศหญิง ทำตัวเป็นผู้หญิง แต่รักใคร่ผู้หญิงด้วยกัน</td>
      </tr>
      <tr class="hover">
        <th>14</th>
        <td>กะเทย</td>
        <td>คนที่มีอวัยวะเพศชาย ทำตัวเป็นผู้หญิง รักใคร่ผู้ชาย</td>
      </tr>
      <tr class="hover">
        <th>15</th>
        <td>อดัม </td>
        <td>คนที่มีอวัยวะเพศชาย ทำตัวเป็นผู้ชาย แต่รักใคร่ทอม</td>
      </tr>
      <tr class="hover">
        <th>16</th>
        <td>แองจี้ </td>
        <td>คนที่มีอวัยวะเพศชาย ทำตัวเป็นผู้หญิง แต่รักใคร่ทอม</td>
      </tr>
      <tr class="hover">
        <th>17</th>
        <td>เชอร์รี่ </td>
        <td>คนที่มีอวัยวะเพศหญิง ทำตัวเป็นผู้หญิง แต่รักใคร่เกย์และกะเทย</td>
      </tr>
      <tr class="hover">
        <th>18</th>
        <td>สามย่าน </td>
        <td>คนที่มีอวัยวะเพศหญิง ทำตัวเป็นผู้หญิง แต่รักใคร่ได้ทั้งเลสเบี้ยน ทอม และผู้ชาย</td>
      </tr>
      <tr class="hover">
        <th>19</th>
        <td>ผู้หญิงข้ามเพศ</td>
        <td>คนที่มีอวัยวะเพศชาย แต่มีจิตใจเป็นหญิง และได้ผ่านการแปลงเพศเป็นผู้หญิงแล้ว</td>
      </tr>
      <tr class="hover">
        <th>20</th>
        <td>ผู้ชายข้ามเพศ</td>
        <td>คนที่มีอวัยวะเพศหญิง แต่มีจิตใจเป็นผู้ชาย และได้ผ่านการแปลงเพศเป็นผู้ชายแล้ว</td>
      </tr>
      <tr>
        <td>แหล่งที่มา</td>
        <td>https://www.isranews.org/content-page/item/58332-sex.html</td>
      </tr>
    </tbody>
  </table>
</div>
    </div>
  );
};
export default Sex;
